irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_fsmc_3075_IUT.c
  uint32_t FSMC_MemoryDataWidth;


  uint32_t FSMC_ECC;


  uint32_t FSMC_ECCPageSize;


  uint32_t FSMC_TCLRSetupTime;



  uint32_t FSMC_TARSetupTime;



  FSMC_NAND_PCCARDTimingInitTypeDef* FSMC_CommonSpaceTimingStruct;

  FSMC_NAND_PCCARDTimingInitTypeDef* FSMC_AttributeSpaceTimingStruct;
}FSMC_NANDInitTypeDef;





typedef struct
{
  uint32_t FSMC_Waitfeature;


  uint32_t FSMC_TCLRSetupTime;



  uint32_t FSMC_TARSetupTime;




  FSMC_NAND_PCCARDTimingInitTypeDef* FSMC_CommonSpaceTimingStruct;

  FSMC_NAND_PCCARDTimingInitTypeDef* FSMC_AttributeSpaceTimingStruct;

  FSMC_NAND_PCCARDTimingInitTypeDef* FSMC_IOSpaceTimingStruct;
}FSMC_PCCARDInitTypeDef;
/* # 679 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\inc/stm32f10x_fsmc.h"*/
void FSMC_NORSRAMDeInit(uint32_t FSMC_Bank);
void FSMC_NANDDeInit(uint32_t FSMC_Bank);
void FSMC_PCCARDDeInit(void);
void FSMC_NORSRAMInit(FSMC_NORSRAMInitTypeDef* FSMC_NORSRAMInitStruct);
void FSMC_NANDInit(FSMC_NANDInitTypeDef* FSMC_NANDInitStruct);
void FSMC_PCCARDInit(FSMC_PCCARDInitTypeDef* FSMC_PCCARDInitStruct);
void FSMC_NORSRAMStructInit(FSMC_NORSRAMInitTypeDef* FSMC_NORSRAMInitStruct);
void FSMC_NANDStructInit(FSMC_NANDInitTypeDef* FSMC_NANDInitStruct);
void FSMC_PCCARDStructInit(FSMC_PCCARDInitTypeDef* FSMC_PCCARDInitStruct);
void FSMC_NORSRAMCmd(uint32_t FSMC_Bank, FunctionalState NewState);
void FSMC_NANDCmd(uint32_t FSMC_Bank, FunctionalState NewState);
void FSMC_PCCARDCmd(FunctionalState NewState);
void FSMC_NANDECCCmd(uint32_t FSMC_Bank, FunctionalState NewState);
uint32_t FSMC_GetECC(uint32_t FSMC_Bank);
void FSMC_ITConfig(uint32_t FSMC_Bank, uint32_t FSMC_IT, FunctionalState NewState);
FlagStatus FSMC_GetFlagStatus(uint32_t FSMC_Bank, uint32_t FSMC_FLAG);
void FSMC_ClearFlag(uint32_t FSMC_Bank, uint32_t FSMC_FLAG);
ITStatus FSMC_GetITStatus(uint32_t FSMC_Bank, uint32_t FSMC_IT);
void FSMC_ClearITPendingBit(uint32_t FSMC_Bank, uint32_t FSMC_IT);
# 23 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c" 2
/* # 101 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NORSRAMDeInit(uint32_t FSMC_Bank)
{ CODESCROLL_FUNC_BEGIN(154, (154, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable421,417) 

  
  CS_CMM_PROBE_NODE_STMT(90,7,0) ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(90,6,1) if(FSMC_Bank == ((uint32_t)0x00000000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable422,418) 
    
    CS_CMM_PROBE_NODE_STMT(90,5,2) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_Bank] = 0x000030DB;
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable423,419) 
    
    CS_CMM_PROBE_NODE_STMT(90,4,3) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_Bank] = 0x000030D2;
  }
  
  CS_CMM_PROBE_NODE_STMT(90,3,4) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_Bank + 1] = 0x0FFFFFFF;
  ((FSMC_Bank1E_TypeDef *) (((uint32_t)0xA0000000) + 0x0104))->BWTR[FSMC_Bank] = 0x0FFFFFFF;

CS_CMM_PROBE_NODE_STMT(90,2,5) 
 CODESCROLL_FUNC_END(154, 12, 118) } CODESCROLL_FUNC_END_RBRACE 
/* # 128 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NANDDeInit(uint32_t FSMC_Bank)
{ CODESCROLL_FUNC_BEGIN(155, (155, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable424,420) 

  
  CS_CMM_PROBE_NODE_STMT(90,1,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(90,0,1) if(FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable425,421) 

    
    CS_CMM_PROBE_NODE_STMT(91,7,2) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PCR2 = 0x00000018;
    ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2 = 0x00000040;
    ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PMEM2 = 0xFCFCFCFC;
    ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PATT2 = 0xFCFCFCFC;
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable426,422) 

    
    CS_CMM_PROBE_NODE_STMT(91,6,3) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PCR3 = 0x00000018;
    ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3 = 0x00000040;
    ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PMEM3 = 0xFCFCFCFC;
    ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PATT3 = 0xFCFCFCFC;
  }

CS_CMM_PROBE_NODE_STMT(91,5,4) 
 CODESCROLL_FUNC_END(155, 12, 150) } CODESCROLL_FUNC_END_RBRACE 






void FSMC_PCCARDDeInit(void)
{ CODESCROLL_FUNC_BEGIN(156, (156, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable427,423) 

  
  CS_CMM_PROBE_NODE_STMT(91,4,0) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PCR4 = 0x00000018;
  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4 = 0x00000000;
  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PMEM4 = 0xFCFCFCFC;
  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PATT4 = 0xFCFCFCFC;
  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PIO4 = 0xFCFCFCFC;

CS_CMM_PROBE_NODE_STMT(91,3,1) 
 CODESCROLL_FUNC_END(156, 12, 165) } CODESCROLL_FUNC_END_RBRACE 
/* # 175 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NORSRAMInit(FSMC_NORSRAMInitTypeDef* FSMC_NORSRAMInitStruct)
{ CODESCROLL_FUNC_BEGIN(157, (157, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable428,424) 

  
  CS_CMM_PROBE_NODE_STMT(91,2,0) ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_NORSRAMInitStruct->FSMC_Bank] =
            (uint32_t)FSMC_NORSRAMInitStruct->FSMC_DataAddressMux |
            FSMC_NORSRAMInitStruct->FSMC_MemoryType |
            FSMC_NORSRAMInitStruct->FSMC_MemoryDataWidth |
            FSMC_NORSRAMInitStruct->FSMC_BurstAccessMode |
            FSMC_NORSRAMInitStruct->FSMC_WaitSignalPolarity |
            FSMC_NORSRAMInitStruct->FSMC_WrapMode |
            FSMC_NORSRAMInitStruct->FSMC_WaitSignalActive |
            FSMC_NORSRAMInitStruct->FSMC_WriteOperation |
            FSMC_NORSRAMInitStruct->FSMC_WaitSignal |
            FSMC_NORSRAMInitStruct->FSMC_ExtendedMode |
            FSMC_NORSRAMInitStruct->FSMC_WriteBurst;
  
  CS_CMM_PROBE_NODE_STMT(91,1,1) if(FSMC_NORSRAMInitStruct->FSMC_MemoryType == ((uint32_t)0x00000008))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable429,425) 
    
    CS_CMM_PROBE_NODE_STMT(91,0,2) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_NORSRAMInitStruct->FSMC_Bank] |= (uint32_t)((uint32_t)0x00000040);
  } CS_CMM_ELSE_PROBE_C1(426) 

  
  CS_CMM_PROBE_NODE_STMT(92,7,3) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_NORSRAMInitStruct->FSMC_Bank+1] =
            (uint32_t)FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_AddressSetupTime |
            (FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_AddressHoldTime << 4) |
            (FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_DataSetupTime << 8) |
            (FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_BusTurnAroundDuration << 16) |
            (FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_CLKDivision << 20) |
            (FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_DataLatency << 24) |
             FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_AccessMode;



  
  CS_CMM_PROBE_NODE_STMT(92,6,4) if(FSMC_NORSRAMInitStruct->FSMC_ExtendedMode == ((uint32_t)0x00004000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable430,427) 
    
    CS_CMM_PROBE_NODE_STMT(92,5,5) ((void)0);
    ((void)0);
    ((void)0);
    ((void)0);
    ((void)0);
    ((void)0);
    ((FSMC_Bank1E_TypeDef *) (((uint32_t)0xA0000000) + 0x0104))->BWTR[FSMC_NORSRAMInitStruct->FSMC_Bank] =
              (uint32_t)FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_AddressSetupTime |
              (FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_AddressHoldTime << 4 )|
              (FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_DataSetupTime << 8) |
              (FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_CLKDivision << 20) |
              (FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_DataLatency << 24) |
               FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_AccessMode;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable431,428) 
    
