irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_fsmc_3075_IUT.c
    CS_CMM_PROBE_NODE_STMT(92,4,6) ((FSMC_Bank1E_TypeDef *) (((uint32_t)0xA0000000) + 0x0104))->BWTR[FSMC_NORSRAMInitStruct->FSMC_Bank] = 0x0FFFFFFF;
  }

CS_CMM_PROBE_NODE_STMT(92,3,7) 
 CODESCROLL_FUNC_END(157, 12, 247) } CODESCROLL_FUNC_END_RBRACE 
/* # 256 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NANDInit(FSMC_NANDInitTypeDef* FSMC_NANDInitStruct)
{ CODESCROLL_FUNC_BEGIN(158, (158, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable432,429) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable433,92,2,0)

  uint32_t tmppcr = 0x00000000, tmppmem = 0x00000000, tmppatt = 0x00000000;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  tmppcr = (uint32_t)FSMC_NANDInitStruct->FSMC_Waitfeature |
            ((uint32_t)0x00000008) |
            FSMC_NANDInitStruct->FSMC_MemoryDataWidth |
            FSMC_NANDInitStruct->FSMC_ECC |
            FSMC_NANDInitStruct->FSMC_ECCPageSize |
            (FSMC_NANDInitStruct->FSMC_TCLRSetupTime << 9 )|
            (FSMC_NANDInitStruct->FSMC_TARSetupTime << 13);


  tmppmem = (uint32_t)FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_SetupTime |
            (FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
            (FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime << 16)|
            (FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime << 24);


  tmppatt = (uint32_t)FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime |
            (FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
            (FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime << 16)|
            (FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime << 24);

  
  CS_CMM_PROBE_NODE_STMT(92,1,1) if(FSMC_NANDInitStruct->FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable434,430) 

    
    CS_CMM_PROBE_NODE_STMT(92,0,2) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PCR2 = tmppcr;
    ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PMEM2 = tmppmem;
    ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PATT2 = tmppatt;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable435,431) 

    
    CS_CMM_PROBE_NODE_STMT(93,7,3) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PCR3 = tmppcr;
    ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PMEM3 = tmppmem;
    ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PATT3 = tmppatt;
  }

CS_CMM_PROBE_NODE_STMT(93,6,4) 
 CODESCROLL_FUNC_END(158, 12, 312) } CODESCROLL_FUNC_END_RBRACE 
/* # 321 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_PCCARDInit(FSMC_PCCARDInitTypeDef* FSMC_PCCARDInitStruct)
{ CODESCROLL_FUNC_BEGIN(159, (159, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable436,432) 

  
  CS_CMM_PROBE_NODE_STMT(93,5,0) ((void)0);
  ((void)0);
  ((void)0);

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PCR4 = (uint32_t)FSMC_PCCARDInitStruct->FSMC_Waitfeature |
                     ((uint32_t)0x00000010) |
                     (FSMC_PCCARDInitStruct->FSMC_TCLRSetupTime << 9) |
                     (FSMC_PCCARDInitStruct->FSMC_TARSetupTime << 13);


  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PMEM4 = (uint32_t)FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_SetupTime |
                      (FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
                      (FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime << 16)|
                      (FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime << 24);


  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PATT4 = (uint32_t)FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime |
                      (FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
                      (FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime << 16)|
                      (FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime << 24);


  ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PIO4 = (uint32_t)FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_SetupTime |
                     (FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
                     (FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_HoldSetupTime << 16)|
                     (FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_HiZSetupTime << 24);

CS_CMM_PROBE_NODE_STMT(93,4,1) 
 CODESCROLL_FUNC_END(159, 12, 365) } CODESCROLL_FUNC_END_RBRACE 







void FSMC_NORSRAMStructInit(FSMC_NORSRAMInitTypeDef* FSMC_NORSRAMInitStruct)
{ CODESCROLL_FUNC_BEGIN(160, (160, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable437,433) 

  
  CS_CMM_PROBE_NODE_STMT(93,3,0) FSMC_NORSRAMInitStruct->FSMC_Bank = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_DataAddressMux = ((uint32_t)0x00000002);
  FSMC_NORSRAMInitStruct->FSMC_MemoryType = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_MemoryDataWidth = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_BurstAccessMode = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_WaitSignalPolarity = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_WrapMode = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_WaitSignalActive = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_WriteOperation = ((uint32_t)0x00001000);
  FSMC_NORSRAMInitStruct->FSMC_WaitSignal = ((uint32_t)0x00002000);
  FSMC_NORSRAMInitStruct->FSMC_ExtendedMode = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_WriteBurst = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_AddressSetupTime = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_AddressHoldTime = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_DataSetupTime = 0xFF;
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_BusTurnAroundDuration = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_CLKDivision = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_DataLatency = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_ReadWriteTimingStruct->FSMC_AccessMode = ((uint32_t)0x00000000);
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_AddressSetupTime = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_AddressHoldTime = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_DataSetupTime = 0xFF;
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_BusTurnAroundDuration = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_CLKDivision = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_DataLatency = 0xF;
  FSMC_NORSRAMInitStruct->FSMC_WriteTimingStruct->FSMC_AccessMode = ((uint32_t)0x00000000);

CS_CMM_PROBE_NODE_STMT(93,2,1) 
 CODESCROLL_FUNC_END(160, 12, 402) } CODESCROLL_FUNC_END_RBRACE 







void FSMC_NANDStructInit(FSMC_NANDInitTypeDef* FSMC_NANDInitStruct)
{ CODESCROLL_FUNC_BEGIN(161, (161, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable438,434) 

  
  CS_CMM_PROBE_NODE_STMT(93,1,0) FSMC_NANDInitStruct->FSMC_Bank = ((uint32_t)0x00000010);
  FSMC_NANDInitStruct->FSMC_Waitfeature = ((uint32_t)0x00000000);
  FSMC_NANDInitStruct->FSMC_MemoryDataWidth = ((uint32_t)0x00000000);
  FSMC_NANDInitStruct->FSMC_ECC = ((uint32_t)0x00000000);
  FSMC_NANDInitStruct->FSMC_ECCPageSize = ((uint32_t)0x00000000);
  FSMC_NANDInitStruct->FSMC_TCLRSetupTime = 0x0;
  FSMC_NANDInitStruct->FSMC_TARSetupTime = 0x0;
  FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_SetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
  FSMC_NANDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;

CS_CMM_PROBE_NODE_STMT(93,0,1) 
 CODESCROLL_FUNC_END(161, 12, 428) } CODESCROLL_FUNC_END_RBRACE 







void FSMC_PCCARDStructInit(FSMC_PCCARDInitTypeDef* FSMC_PCCARDInitStruct)
{ CODESCROLL_FUNC_BEGIN(162, (162, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable439,435) 

  
