irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_fsmc_3075_IUT.c
  CS_CMM_PROBE_NODE_STMT(94,7,0) FSMC_PCCARDInitStruct->FSMC_Waitfeature = ((uint32_t)0x00000000);
  FSMC_PCCARDInitStruct->FSMC_TCLRSetupTime = 0x0;
  FSMC_PCCARDInitStruct->FSMC_TARSetupTime = 0x0;
  FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_SetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_SetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
  FSMC_PCCARDInitStruct->FSMC_IOSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;

CS_CMM_PROBE_NODE_STMT(94,6,1) 
 CODESCROLL_FUNC_END(162, 12, 454) } CODESCROLL_FUNC_END_RBRACE 
/* # 467 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NORSRAMCmd(uint32_t FSMC_Bank, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(163, (163, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable440,436) 
  
  CS_CMM_PROBE_NODE_STMT(94,5,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(94,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable441,437) 

    
    CS_CMM_PROBE_NODE_STMT(94,3,2) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_Bank] |= ((uint32_t)0x00000001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable442,438) 

    
    CS_CMM_PROBE_NODE_STMT(94,2,3) ((FSMC_Bank1_TypeDef *) (((uint32_t)0xA0000000) + 0x0000))->BTCR[FSMC_Bank] &= ((uint32_t)0x000FFFFE);
  }

CS_CMM_PROBE_NODE_STMT(94,1,4) 
 CODESCROLL_FUNC_END(163, 12, 482) } CODESCROLL_FUNC_END_RBRACE 
/* # 493 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NANDCmd(uint32_t FSMC_Bank, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(164, (164, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable443,439) 
  
  CS_CMM_PROBE_NODE_STMT(94,0,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(95,7,1) if (NewState != DISABLE)
  {

    
    CS_CMM_PROBE_NODE_STMT(95,6,2) if(FSMC_Bank == ((uint32_t)0x00000010))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable444,440) 
      
      CS_CMM_PROBE_NODE_STMT(95,5,3) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PCR2 |= ((uint32_t)0x00000004);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable445,441) 
      
      CS_CMM_PROBE_NODE_STMT(95,4,4) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PCR3 |= ((uint32_t)0x00000004);
    }
  }
  else
  {

    
    CS_CMM_PROBE_NODE_STMT(95,3,5) if(FSMC_Bank == ((uint32_t)0x00000010))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable446,442) 
      
      CS_CMM_PROBE_NODE_STMT(95,2,6) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PCR2 &= ((uint32_t)0x000FFFFB);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable447,443) 
      
      CS_CMM_PROBE_NODE_STMT(95,1,7) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PCR3 &= ((uint32_t)0x000FFFFB);
    }
  }

CS_CMM_PROBE_NODE_STMT(95,0,8) 
 CODESCROLL_FUNC_END(164, 12, 522) } CODESCROLL_FUNC_END_RBRACE 







void FSMC_PCCARDCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(165, (165, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable448,444) 
  
  CS_CMM_PROBE_NODE_STMT(96,7,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(96,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable449,445) 

    
    CS_CMM_PROBE_NODE_STMT(96,5,2) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PCR4 |= ((uint32_t)0x00000004);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable450,446) 

    
    CS_CMM_PROBE_NODE_STMT(96,4,3) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->PCR4 &= ((uint32_t)0x000FFFFB);
  }

CS_CMM_PROBE_NODE_STMT(96,3,4) 
 CODESCROLL_FUNC_END(165, 12, 544) } CODESCROLL_FUNC_END_RBRACE 
/* # 556 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_NANDECCCmd(uint32_t FSMC_Bank, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(166, (166, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable451,447) 
  
  CS_CMM_PROBE_NODE_STMT(96,2,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(96,1,1) if (NewState != DISABLE)
  {

    
    CS_CMM_PROBE_NODE_STMT(96,0,2) if(FSMC_Bank == ((uint32_t)0x00000010))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable452,448) 
      
      CS_CMM_PROBE_NODE_STMT(97,7,3) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PCR2 |= ((uint32_t)0x00000040);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable453,449) 
      
      CS_CMM_PROBE_NODE_STMT(97,6,4) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PCR3 |= ((uint32_t)0x00000040);
    }
  }
  else
  {

    
    CS_CMM_PROBE_NODE_STMT(97,5,5) if(FSMC_Bank == ((uint32_t)0x00000010))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable454,450) 
      
      CS_CMM_PROBE_NODE_STMT(97,4,6) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->PCR2 &= ((uint32_t)0x000FFFBF);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable455,451) 
      
      CS_CMM_PROBE_NODE_STMT(97,3,7) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->PCR3 &= ((uint32_t)0x000FFFBF);
    }
  }

CS_CMM_PROBE_NODE_STMT(97,2,8) 
 CODESCROLL_FUNC_END(166, 12, 585) } CODESCROLL_FUNC_END_RBRACE 
/* # 595 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
uint32_t FSMC_GetECC(uint32_t FSMC_Bank)
{ CODESCROLL_FUNC_BEGIN(167, (167, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable456,452) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable457,97,1,0)

  uint32_t eccval = 0x00000000;

  
