irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_fsmc_3075_IUT.c
  CS_CMM_PROBE_NODE_STMT(97,0,1) if(FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable458,453) 

    
    CS_CMM_PROBE_NODE_STMT(98,7,2) eccval = ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->ECCR2;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable459,454) 

    
    CS_CMM_PROBE_NODE_STMT(98,6,3) eccval = ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->ECCR3;
  }

  
  CS_CMM_PROBE_NODE_STMT(98,5,4) 
   CODESCROLL_FUNC_END(167, 12, 610) return(eccval);
} CODESCROLL_FUNC_END_RBRACE 
/* # 629 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_ITConfig(uint32_t FSMC_Bank, uint32_t FSMC_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(168, (168, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable460,455) 
  
  CS_CMM_PROBE_NODE_STMT(98,4,0) ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(98,3,1) if (NewState != DISABLE)
  {

    
    CS_CMM_PROBE_NODE_STMT(98,2,2) if(FSMC_Bank == ((uint32_t)0x00000010))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable461,456) 
      
      CS_CMM_PROBE_NODE_STMT(98,1,3) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2 |= FSMC_IT;
    }

    else { 
    CS_CMM_PROBE_NODE_STMT(98,0,4) if (FSMC_Bank == ((uint32_t)0x00000100))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable462,457) 
      
      CS_CMM_PROBE_NODE_STMT(99,7,5) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3 |= FSMC_IT;
    }

    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable463,458) 
      
      CS_CMM_PROBE_NODE_STMT(99,6,6) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4 |= FSMC_IT;
    }
    }
  }
  else
  {

    
    CS_CMM_PROBE_NODE_STMT(99,5,7) if(FSMC_Bank == ((uint32_t)0x00000010))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable464,459) 

      
      CS_CMM_PROBE_NODE_STMT(99,4,8) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2 &= (uint32_t)~FSMC_IT;
    }

    else { 
    CS_CMM_PROBE_NODE_STMT(99,3,9) if (FSMC_Bank == ((uint32_t)0x00000100))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable465,460) 
      
      CS_CMM_PROBE_NODE_STMT(99,2,10) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3 &= (uint32_t)~FSMC_IT;
    }

    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable466,461) 
      
      CS_CMM_PROBE_NODE_STMT(99,1,11) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4 &= (uint32_t)~FSMC_IT;
    }
    }
  }

CS_CMM_PROBE_NODE_STMT(99,0,12) 
 CODESCROLL_FUNC_END(168, 12, 672) } CODESCROLL_FUNC_END_RBRACE 
/* # 689 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
FlagStatus FSMC_GetFlagStatus(uint32_t FSMC_Bank, uint32_t FSMC_FLAG)
{ CODESCROLL_FUNC_BEGIN(169, (169, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable467,462) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable468,100,7,0)

  FlagStatus bitstatus = RESET;
  uint32_t tmpsr = 0x00000000;


  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(100,6,1) if(FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable469,463) 
    
    CS_CMM_PROBE_NODE_STMT(100,5,2) tmpsr = ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(100,4,3) if(FSMC_Bank == ((uint32_t)0x00000100))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable470,464) 
    
    CS_CMM_PROBE_NODE_STMT(100,3,4) tmpsr = ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3;
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable471,465) 
    
    CS_CMM_PROBE_NODE_STMT(100,2,5) tmpsr = ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4;
  }
  }


  
  CS_CMM_PROBE_NODE_STMT(100,1,6) if ((tmpsr & FSMC_FLAG) != (uint16_t)RESET )
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable472,466) 
    
    CS_CMM_PROBE_NODE_STMT(100,0,7) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable473,467) 
    
    CS_CMM_PROBE_NODE_STMT(101,7,8) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(101,6,9) 
   CODESCROLL_FUNC_END(169, 12, 722) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 739 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_ClearFlag(uint32_t FSMC_Bank, uint32_t FSMC_FLAG)
{ CODESCROLL_FUNC_BEGIN(170, (170, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable474,468) 

  
  CS_CMM_PROBE_NODE_STMT(101,5,0) ((void)0);
  ((void)0) ;

  
  CS_CMM_PROBE_NODE_STMT(101,4,1) if(FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable475,469) 
    
    CS_CMM_PROBE_NODE_STMT(101,3,2) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2 &= ~FSMC_FLAG;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(101,2,3) if(FSMC_Bank == ((uint32_t)0x00000100))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable476,470) 
    
    CS_CMM_PROBE_NODE_STMT(101,1,4) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3 &= ~FSMC_FLAG;
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable477,471) 
    
    CS_CMM_PROBE_NODE_STMT(101,0,5) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4 &= ~FSMC_FLAG;
  }
  }

CS_CMM_PROBE_NODE_STMT(102,7,6) 
 CODESCROLL_FUNC_END(170, 12, 758) } CODESCROLL_FUNC_END_RBRACE 
/* # 774 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
ITStatus FSMC_GetITStatus(uint32_t FSMC_Bank, uint32_t FSMC_IT)
{ CODESCROLL_FUNC_BEGIN(171, (171, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable478,472) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable479,102,6,0)

