irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_fsmc_3075_IUT.c
  ITStatus bitstatus = RESET;
  uint32_t tmpsr = 0x0, itstatus = 0x0, itenable = 0x0;


  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(102,5,1) if(FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable480,473) 
    
    CS_CMM_PROBE_NODE_STMT(102,4,2) tmpsr = ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(102,3,3) if(FSMC_Bank == ((uint32_t)0x00000100))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable481,474) 
    
    CS_CMM_PROBE_NODE_STMT(102,2,4) tmpsr = ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3;
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable482,475) 
    
    CS_CMM_PROBE_NODE_STMT(102,1,5) tmpsr = ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4;
  }
  }

  
  CS_CMM_PROBE_NODE_STMT(102,0,6) itstatus = tmpsr & FSMC_IT;

  itenable = tmpsr & (FSMC_IT >> 3);
  
  CS_CMM_PROBE_NODE_STMT(103,7,7) if (CS_MCDC_171_2((itstatus != (uint32_t)RESET), (itenable != (uint32_t)RESET), 33))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable483,22) 
    
    CS_CMM_PROBE_NODE_STMT(103,6,8) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable484,23) 
    
    CS_CMM_PROBE_NODE_STMT(103,5,9) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(103,4,10) 
   CODESCROLL_FUNC_END(171, 12, 808) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 825 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_fsmc.c"*/
void FSMC_ClearITPendingBit(uint32_t FSMC_Bank, uint32_t FSMC_IT)
{ CODESCROLL_FUNC_BEGIN(172, (172, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable485,476) 

  
  CS_CMM_PROBE_NODE_STMT(103,3,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(103,2,1) if(FSMC_Bank == ((uint32_t)0x00000010))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable486,477) 
    
    CS_CMM_PROBE_NODE_STMT(103,1,2) ((FSMC_Bank2_TypeDef *) (((uint32_t)0xA0000000) + 0x0060))->SR2 &= ~(FSMC_IT >> 3);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(103,0,3) if(FSMC_Bank == ((uint32_t)0x00000100))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable487,478) 
    
    CS_CMM_PROBE_NODE_STMT(104,7,4) ((FSMC_Bank3_TypeDef *) (((uint32_t)0xA0000000) + 0x0080))->SR3 &= ~(FSMC_IT >> 3);
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable488,479) 
    
    CS_CMM_PROBE_NODE_STMT(104,6,5) ((FSMC_Bank4_TypeDef *) (((uint32_t)0xA0000000) + 0x00A0))->SR4 &= ~(FSMC_IT >> 3);
  }
  }

CS_CMM_PROBE_NODE_STMT(104,5,6) 
 CODESCROLL_FUNC_END(172, 12, 844) } CODESCROLL_FUNC_END_RBRACE 
